---
kind: method
id: M:Autodesk.Revit.DB.FabricationItemFolder.GetItemFiles
source: html/bc33c7bf-045d-6059-1f33-655c7484ce47.htm
---
# Autodesk.Revit.DB.FabricationItemFolder.GetItemFiles Method

Gets the item files in this item folder.

## Syntax (C#)
```csharp
public IList<FabricationItemFile> GetItemFiles()
```